#include<iostream>
using namespace std;

int main()
{
   unsigned int a = 60;      // 60 = 0011 1100  
   unsigned int b = 13;      // 13 = 0000 1101
   int c = 0;           
 
   c = a & b;             // 12 = 0000 1100
   cout << c << endl ;    //两个操作数中，每一位都为1时结果才为1，否则为0
 
   c = a | b;             // 61 = 0011 1101
   cout << c << endl ;    //两个操作数中，至少有一个位为1时结果就为1
 
   c = a ^ b;             // 49 = 0011 0001
   cout << c << endl ;    //两个操作数中，对应位不同则结果为1，相同则为0
 
   c = ~a;                // -61 = 1100 0011
   cout << c << endl ;    //对操作数的每一位进行取反，0变1，1变0
 
   c = a << 2;            // 240 = 1111 0000
   cout << c << endl ;    //将操作数的二进制表示向左移动指定的位数，右边空出的位补0
 
   c = a >> 2;            // 15 = 0000 1111
   cout << c << endl ;    //将操作数的二进制表示向右移动指定的位数，左边空出的位补符号位（正数补0，负数补1）

   return 0;
}